TheiaSpace/ESAT-MSP430-platform/esat/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

#ESAT-OBC

ESAT-OBC.name=ESAT-OBC
ESAT-OBC.build.mcu=msp430f5529
ESAT-OBC.build.core=msp430
ESAT-OBC.build.f_cpu=25000000L
ESAT-OBC.build.variant=ESAT-OBC
ESAT-OBC.build.board=ESAT-OBC

ESAT-OBC.upload.protocol=msp430-tool
ESAT-OBC.upload.maximum_size=131072
ESAT-OBC.upload.maximum_ram_size=1024
